# 出行指南
walk_out_guide_dict = {
    '阴': "阴天，可能下雨，出行带伞",
    '雾': "出行请注意安全，保持距离",
    '小雨': '出行请带伞',
    '多云': '天气多云，适合外出',
    '晴': "天气晴朗，适合出行，出行请做好防晒",
    '中雨': '出行请带好伞',
    '雨夹雪': "出行注意安全，保湿距离",
    '大雨': "大雨视野受限，请减慢速度行驶",
    '小雪': '视情况而定，可以带伞',
    '阵雨': '出行请带伞',
    '雷阵雨': "出行请带伞",
    '中雪': "请带伞，并且注意行车速度",
    '大雪': "请带伞，并且注意行车速度",
    '暴雨': "请带伞，注意行车速度,不适宜出行",
    '阵雪': '视情况而定，可以带伞',
    '暴雪': "请带伞，注意行车速度,不适宜出行",
    '扬沙': "请带好口罩眼睛，加速慢性",
    '浮尘': "请带好口罩眼睛，加速慢性",
    '沙尘暴': "请带好口罩眼睛，加速慢性",
    '大暴雨': "不适合出行，建议雨停后出行"
}

# 穿衣指南
wear_guide_dict = {
    30: '轻棉织物制作的短衣、短裙、薄短裙、短裤',
    25: '棉麻面料的衬衫、薄长裙、薄T恤',
    20: "套装、夹衣、风衣、休闲装、夹克衫、西装、薄毛衣",
    15: "风衣、大衣、夹大衣、外套、毛衣、毛套装、西装、防寒服",
    10: "棉衣、冬大衣、皮夹克、外罩大衣、厚毛衣、皮帽皮手套、皮袄",
    5: '棉衣、冬大衣、皮夹克、厚呢外套、呢帽、手套、羽绒服、皮袄',
    0: "棉衣、冬大衣、皮夹克、厚呢外套、呢帽、手套、羽绒服、裘皮大衣"
}
